[
    {
        "id": "2d73d6a6-ffc9-4b2e-9660-aa5353ce847f",
        "text": "More exploration and cleaning yields good returns! Cracked Teeth is on the left side of Buda Belly wall proper, just left of Breezy. Climb up some easy ledges to the base of a small, shallow corner. Clip the first bolt on the right face and then make fun moves, pulling on the crack and pockets on the face to a stance. Clip the 2nd bolt and climb easy terrain up the 'plates' past a 3rd bolt, heading to the base of the broken looking crack and corner looming above. From the ledge, clip the 4th bolt and then climb up the broken corner and left face arching leftward past 3 more bolts (7 total). Lower from the chains.",
        "climb_id": "bb053566-0ef7-44fc-809b-5aa24800f011",
        "user_id": ""
    },
    {
        "id": "fddb6982-677a-4c5a-b4b6-2eed406e6f9d",
        "text": "Head straight up the main slab past the left pair of 2 bolts. At the ledge, clip a bolt up and left and follow pockets up and slightly left past a bolt near the 'golf ball' hold. Move up past the bulge and punch it to the top past the final bolts. Variation #1. 'Way of the Ninja'  Rather than moving directly up off the golf ball, one can move hard left horizontally to a jug on the the far right of the Brizzy ledge and then punch up into the corner from there.  Finish as normal.  FA - Leck Null ~2008.",
        "climb_id": "b18b30a9-1c8e-43a2-9856-369a5a1369c3",
        "user_id": ""
    },
    {
        "id": "d2ea6b25-a820-4bb3-8083-23d1aafe721c",
        "text": "Begins down on the lower ground (lots of fresh dirt). Climb up easy ledges and broken rock between the two trees to the base of the headwall with dual cracks. Tricky moves through the overhanging cracks gets you onto the ledge. Climb up and right into a still-needs-some-cleaning groove using better holds on the left face. Gain the next ledge. Con't up and slightly left to the final headwall below a small flake/finger crack. Bouldery crux up high gets you to the anchor which is a bit tricky to clip.",
        "climb_id": "f0a1bb7f-b458-46ac-bd57-335064ab75c1",
        "user_id": ""
    },
    {
        "id": "76eae71e-6955-4edb-9deb-298dc36eeed4",
        "text": "Start right of Dr JoJo.  Pull up onto the first large ledge using good holds.  Clip a high bolt off the ledge and then pull up into the slot before clipping a 3rd bolt and climbing up to the base of the headwall (4th bolt just below small stance).  Clip another high bolt and make the crux moves though the 'blankness' into a thin left facing corner/flake.  continue up and slightly left past more bolts to the anchor.  Mussy Lower off.",
        "climb_id": "b42e8916-80f9-4c58-8672-39da23c71af6",
        "user_id": ""
    },
    {
        "id": "637a71ed-7e8b-4637-8d56-179f886b9c64",
        "text": "An older route in need of a name. A run in with a LARGE, HAIRY and SPIKE covered bug near the top in the crack seemed like a good namesake. Follow bolts up and slightly left. Near the top, in a shallow corner, follow a crack and blocky rock up to the anchor.",
        "climb_id": "05d31eae-8b71-41d7-8c94-2154321b6744",
        "user_id": ""
    },
    {
        "id": "079dc81b-8432-42e0-8675-3978675c567f",
        "text": "THE classic at OT. Fun moves on good (for the most part) rock to the top of the wall. Follow  glue ins up the left side of the 'swiss cheese' bulge to a ledge. Lower or continue up more broken terrain to the top of the wall.",
        "climb_id": "55f21262-5ec9-4b2c-a43c-47d0526165f8",
        "user_id": ""
    },
    {
        "id": "84b5cd76-64ae-4932-8622-dfe7491f4a13",
        "text": "Good holds, great movement, stunning setting! Follow the black bolt line on the south side of the tower to a secure top out. (Note: there are two extra bolts just to the left of the main line for another route in progress)",
        "climb_id": "ea1c66c9-9fd6-4f36-b3c3-4fa33e62991e",
        "user_id": ""
    },
    {
        "id": "8448e881-1374-4f11-8317-a4c3c36ea7e2",
        "text": "Pitch 1: Offwidth to jugs, up a ledge. Trend left to the left side of the roof. It's a little bit of a squeeze, but there's a bolt in your face.Pitch 2: Face moves that trend into double cracks. Bolts are to climber's right to mitigate rope drag. Pitch 3: An exposed arete evolves into face climbing moves. Head up and left over an overhang. Bring a 70 as there are 35m raps to get down Bring 20+ draws. 'It was rumored that he (Victorio) faked his death and disappeared into the vast Mexican mountains of the Sierra Madre. Ironically enough, no body was ever recovered.'",
        "climb_id": "33c4aa80-1da4-4e3b-a140-f624bd175efc",
        "user_id": ""
    },
    {
        "id": "7db02f97-63ff-40b0-8531-e0bfdd5fc4ef",
        "text": "I put this route up after I mended from a FX wrist. It was worth the effort An unusual bone white face of rhyolite just right of Geronimo's arete, this line shoots up thin face and even a crack move or two. ",
        "climb_id": "51c97c16-4d74-4ce1-8f89-d2bd8d27a9ca",
        "user_id": ""
    },
    {
        "id": "598e58b3-7546-4ead-89e1-352fcece752e",
        "text": "This route ascends the the NW side of the pillar.  The start of the bolted route consists of pulling over a slight bulge on the north side of the pillar.",
        "climb_id": "25129f11-4639-4b5e-ab32-d56a635a0221",
        "user_id": ""
    },
    {
        "id": "8dd060ab-7739-4198-ac61-605810f70ae7",
        "text": "Climb the arête located on the far right of the north-facing face and buttress of Heaven's Gate, lower than the corridor. Prominent chimney is to the left of this arête and line of bolts should be obvious. Begin on poor rock, thin holds and delicate-tricky moves through the first 3 bolts. Clip the fourth and get ready for prolonged bulging crux where footwork is key. Standard anchors with biners for lowering or top-roping. Note that we have climbed the chimney in various ways to get to these anchors and it offers quality rock and fun chimney practice. Thin protection in the chimney.",
        "climb_id": "418faa1b-1c67-4b4c-bbe6-032f4601a972",
        "user_id": ""
    },
    {
        "id": "ec73b551-0e82-46ba-a181-ca2339e16cfe",
        "text": "Excellent rock, great length, and fun, fun, fun. Guide book suggests 11a. Climbs more like a 10b/c.",
        "climb_id": "a337ea77-b87a-4e9e-9d09-ceddd0d0fa4f",
        "user_id": ""
    },
    {
        "id": "afa175f6-a56b-4e63-8b35-7d5b84b0dd64",
        "text": "One of the best 5.9 cracks in Joshua Tree. Start out in sustained double finger cracks until the right crack peters out. Continue up left crack as it turns to perfect hands and finishes with a small juggy roof.Belay from a large boulder (gear required) atop the formation. To descend: scramble west through a notch, downclimb into a rock gully and then scramble down the gully (heading east towards Echo Rock) until it opens up and you can make a left back towards your pack.",
        "climb_id": "ce7fed7c-2f1c-4d75-92c9-a599d97f764a",
        "user_id": ""
    },
    {
        "id": "45f21f0c-79af-4c3e-a420-2a2d0eb4126d",
        "text": "This is the next route left of Touch and Go. A thin crack leads up to a large, sloping ledge. Clip a bolt and pull sloper face moves above the ledge. Holds get better and the moves easier leading up as it is increasingly runout. Small cams at the top protect the exit moves. It seems like the second bolt was chopped at some point and is no longer around.",
        "climb_id": "2665ff8c-74fd-42e9-94b7-8ec9d0b5f154",
        "user_id": ""
    },
    {
        "id": "f6ceda21-0b8a-44db-bc62-ccfcec8ce3fe",
        "text": "This is the blunt arete to the left of the Etude cracks. Very bouldery but fun! Not fixed hardware was installed in this cliff so this is a TR.",
        "climb_id": "454528a5-31c9-4578-9f60-f13f70adeaa1",
        "user_id": ""
    },
    {
        "id": "1c9cfad6-e8f3-4b5b-8ac5-db4fb4afa355",
        "text": "This is more of an escape for 'Etude No.20' climb the crack until it starts getting hard, then bust Right onto this crack for an easy finish.",
        "climb_id": "90305add-d5ef-4611-b874-4633462b0cfe",
        "user_id": ""
    },
    {
        "id": "85be4bba-9ce4-4a6d-81d4-33e99bf4fb83",
        "text": "Fairly continuous with enjoyable movement throughout it's length and easily top-roped from the bolted anchor atop Sig Alert. Mistakenly listed as Gridlock in the Joshua Tree West guidebook.",
        "climb_id": "d69a3bdd-8450-46e3-9e08-8a86f2b085b1",
        "user_id": ""
    },
    {
        "id": "93330bf5-a4db-4f04-b6df-a81f1a66b677",
        "text": "Cakewalk climbs an obvious crack on the south side of Freeway Wall, fairly high up the gully before reaching the highpoint of a small pass. Climb the nice thin hand crack up to where the wall steepens and the crack thins. Traverse left a few feet to a juggy hand crack going over a small overhang. Head up and a bit right on the crack as it goes from hands to fingers to fist. This is a nice sustained pitch. Pretty easy for 5.9 - this is a good lead for those breaking into 9.",
        "climb_id": "708ecf93-cb35-4660-b320-f786d2fc3cef",
        "user_id": ""
    },
    {
        "id": "0fc21601-229d-4525-829c-2c35241ecdfb",
        "text": "Two pitches with different characters in a right facing corner. P1 works up through a widening crack into a steep and thoughtful stemming problem - 100’ 5.10. P2 blasts up all sizes of hands with some .75s to keep you honest - 110’ 5.10+.",
        "climb_id": "ac82ec28-c28b-4a73-81c4-b998899888be",
        "user_id": ""
    },
    {
        "id": "984ca915-7d49-44e3-aceb-424a9bb75b38",
        "text": "left facing corner hands most the way with great rest, ending a short section of fists and OW",
        "climb_id": "e16b1b97-bf9b-452c-baa8-f401d6677599",
        "user_id": ""
    },
    {
        "id": "7283b530-ba41-4416-a28f-edae6422ac3a",
        "text": "A few thin moves down low to gain the top of the block....and it's hands and big hands to the anchor. Some small loose blocks were removed at the start. The remaining blocks seem to be quite solid. There is a small ledge about half way up that still has some rocks chillin' on it.",
        "climb_id": "d3f77778-ece1-4c2d-9fd2-94dbadf11f6d",
        "user_id": ""
    },
    {
        "id": "ce72dc17-28af-4b85-b61c-0b3f2221c9c7",
        "text": "Geologic time includes now! Apparently this thing continues to widen....better hop on it while you can. Just right of the giant slumped block by Pente, about 25 feet of facey climbing protected by a bolt accesses a long acute dihedral with a tight-hands crack in the back-- the Slot Machine. Exiting the crack at the top is probably the crux, as one is forces to battle rope drag and sandy feet while underclinging around the roof closing off the top of the dihedral. We found the Slot Machine to be sustained and strenuous, but hardly 5.12 as described in the Knapp guide. Placque at base. Good anchors.",
        "climb_id": "7f268b42-993b-466d-bc5f-5344fed6ca83",
        "user_id": ""
    },
    {
        "id": "731ef0e9-81fb-481e-b493-bd1f0fd863bb",
        "text": "Hand crack on the far left side of Sparks wall that somewhat resembles a mini Generic Crack. Short, but long enough for some enjoyable hand jamming with one short OW move at the top.",
        "climb_id": "a5c7d42f-02ef-4c03-8d7d-268cc0bdd83d",
        "user_id": ""
    },
    {
        "id": "474d8a27-b272-479c-bd91-66c6edfb7373",
        "text": "This Yacht Rock inspired route is a short but burly tips lieback corner. Difficulty is very finger size dependent, but it's somewhere in the 11+ to 12 range. It is stacks more difficult to lead and than TR, as usual, so don't get too uppity about the grade after your partner puts the rope up and you flash it on the dull end. There is a somewhat unnecessary bolt that I placed to get past some subsequently cleaned choss, and it's a little bit of a reachy clip. Sorry. I left it because empty holes are ugly and it is nice to have for the overhanging finishing moves instead of yet another itty-bitty cam cam. 2 stars because the route is short, but its good fun and nice rock.",
        "climb_id": "a225d74d-b5c5-4685-bb05-4d712408e155",
        "user_id": ""
    },
    {
        "id": "104f25c8-d60d-4a90-85f7-7ce749653834",
        "text": "Start doing your calf raises now because this one's a real pumper!  Mosey up some easier terrain, placing a few cams as you go toward the first bolt on this wild ride.  Clip it and begin the never-ending pure stemming adventure up this beautiful 120 degree obtuse shaft.  Incredible stemming on delicately rippling walls, intensely engaging full body tension, and the occasional tiny edge or nubbin for the hands and feet are what await you.  Climb past 9 bolts until the seam on the right opens wide enough to take gear.  Don't worry though, the intensity of this rig is far from over!  Several tiny pieces from ballnuts and RPs lead to micro cams and eventually to fingers.  Clip the anchor and give those calves a rest! This climb is pretty sick, I highly recommend checking it out.  No moves harder than 5.11, but no moves easier either. I have not done the second pitch 5.11c finger crack but it looks pretty good.  The P1 anchor would be a FULLY hanging belay.",
        "climb_id": "70f8100a-fe84-4c10-a813-13846fe388aa",
        "user_id": ""
    },
    {
        "id": "bbfda619-3c6b-4cfb-b132-be98e8ad42f5",
        "text": "The Durrance route is listed as one of the 50 classic climbs in North America. A 4-6 pitch route that tops out at the summit. The climb is mainly off-width and hand-crack with a few spots of chimney. You also get the choice of working a small traverse. Don't forget to register at the Visitor's Center before and after the climb. This is a crowded route and a few minutes can mean the difference between success and failure. Either plan to arrive around 5:30 AM or, if you're fast and have headlamps, try to start in the late afternoon.",
        "climb_id": "9cb01524-2a09-4180-8317-a569917370df",
        "user_id": ""
    },
    {
        "id": "d5615d93-afa5-4640-84e2-7f14dace9aba",
        "text": "This fine corner is one line left of Carol's Crack and is most conveniently completed in two short (80') pitches. To start, scramble up and left around the blocks and flakes left of Carol's and belay in the broken area. A moderate (5.8) first pitch takes the crack system that is two cracks left of Carol's, then trends right at about half a rope-length to a belay (this coincides with most of the first pitch of Whine and Bruises and avoids lesser quality rock in the right crack). The crux second pitch takes finger jams, laybacks, and stems up the corner to a fairly distinct crux section near the top. Spiney Norman was orignally graded 12a, partially because of a bit of lichen at the crux. It has cleaned up nicely into another worthwhile outing at 11c.",
        "climb_id": "0b4bb4c0-4dfa-4e20-831a-65cd342dcd19",
        "user_id": ""
    },
    {
        "id": "ea2c0325-a05f-4043-9b0a-c436e4a4539e",
        "text": "Located between 'pyscic turbulence' and 'four play', four cracks left of 'carols'. Was supposed to be done w/ frank sanders but he graciously let us have at it. Climb pitch 1 of 'psychic' (5.7). (p2)traverse right one crack (5.8) and continue up on thin aid (A2 into A3-), until possible to traverse back to the 'psychic' anchors, or to the 'four play' anchors. Continue up (loose 5.9)to the summit, or rappel. Gear: Standard aid rack,thin pins, tie-offs, small stoppers and heads are suggested.",
        "climb_id": "0bef8e14-9039-471c-a1fc-2ac973b9e978",
        "user_id": ""
    },
    {
        "id": "1c9b9547-d09a-4202-901d-d96ba3fb6564",
        "text": "This is a VERY enjoyable pitch with excellent protection. Another Tower dihedral which utilizes stemming and a few face moves. The crux comes about 20 or so feet below the anchors.",
        "climb_id": "2727b26a-ffd9-4094-a006-b33a23cc20b5",
        "user_id": ""
    },
    {
        "id": "c8fd80b5-ff43-4274-bd77-b4bb8e619bdf",
        "text": "A remarkable stem problem that Steve Hong claimed would be, 'impossible for people under 5'6''. Don't know if this is true, but most of the pitch requires splits-style stemming between the good corner on the right and incipient features on the left...flexibility is a must! A bolt protects the crux section at about 1/3 height. The upper bit eases off as a shallow corner-crack materializes on the left. Those legs will be worked by the top! A proud lead or a great TR from the anchors on P1 of Tulgey Wood.",
        "climb_id": "cf0a95db-faad-4e6a-a38e-ddca23110f27",
        "user_id": ""
    }
]